samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
/**
 * @file active_object_test.cpp
 * 
 * @author Sam Donnelly (samueldonnelly11@gmail.com)
 * 
 * @brief Active Object design pattern test 
 * 
 * @version 0.1
 * @date 2024-03-21
 * 
 * @copyright Copyright (c) 2024
 * 
 */

//=======================================================================================
// Includes 

#include "active_object_test.h" 
#include "includes_drivers.h" 
#include "stm32f4xx_it.h" 

// FreeRTOS 
#include "FreeRTOS.h"
#include "task.h"
#include "cmsis_os2.h"
#include "queue.h" 
#include "semphr.h" 
#include "timers.h" 

//=======================================================================================


//=======================================================================================
// Macros 

// Conditional compilation 
#define AO_C_TEST 0 
#define AO_CPP_TEST 0 

// Memory 
#define MIN_STACK_MULTIPLE 8 
#define THREAD_LOW_STACK_SIZE configMINIMAL_STACK_SIZE * MIN_STACK_MULTIPLE 
#define THREAD_HIGH_STACK_SIZE configMINIMAL_STACK_SIZE * MIN_STACK_MULTIPLE 

// Data 
#define SERIAL_INPUT_MAX_LEN 30 

// Timing 
#define LED_SLOW_BLINK_PERIOD 500   // (ticks) 
#define LED_FAST_BLINK_PERIOD 100   // (ticks) 

//=======================================================================================


//=======================================================================================
// Active Object module data 

//==================================================
// Datatype 

typedef uint8_t Event; 

//==================================================

//==================================================
// Objects 

// Thread Event Info 
typedef struct 
{
    osThreadAttr_t attr;              // Thread attributes 
    uint8_t event;                    // Event index 
    QueueHandle_t ThreadEventQueue;   // Queue 
    void (*dispatch)(Event event);    // Dispatch function 
}
ThreadEventData; 

//==================================================

//==================================================
// Prototypes 

/**
 * @brief Common event loop shared by all threads 
 * 
 * @param thread_info : thread info such as the event queue handler and dispatch function 
 */
void eventLoop(void *thread_info); 

//==================================================

//=======================================================================================


//=======================================================================================
// System threads 

class SystemData 
{
private:   // Private members 

    //==================================================
    // Low Priority Thread 

    // Low Priority Thread States 
    enum class ThreadLowStates
    {
        SERIAL_OUT_STATE, 
        SERIAL_IN_STATE, 
        NUM_STATES 
    } 
    thread_low_state; 

    // Low Priority Thread Events 
    enum class ThreadLowEvents
    {
        NO_EVENT, 
        SERIAL_OUT_EVENT, 
        SERIAL_IN_EVENT 
    }; 

    // System info 
    ThreadEventData thread_low_event_data; 
    const uint8_t thread_low_queue_len = 3; 

    // Flags 
    typedef struct 
    {
        // System flags 
        uint8_t state_entry : 1; 

        // State flags 
        uint8_t serial_out  : 1; 
        uint8_t serial_in   : 1; 
    } 
    ThreadLowFlags; 

    //==================================================

    //==================================================
    // High Priority Thread 

    // High Priority Thread States 
    enum class ThreadHighStates 
    {
        LED_SLOW_STATE, 
        LED_FAST_STATE, 
        NUM_STATES 
    }
    thread_high_state; 

    // High Priority Thread Events 
    enum class ThreadHighEvents 
    {
        NO_EVENT, 
        LED_TOGGLE_EVENT 
    }; 

    // System info 
    ThreadEventData thread_high_event_data; 
    const uint8_t thread_high_queue_len = 3; 

    // Flags 
    struct ThreadHighFlags
    {
        // System flags 
        uint8_t state_entry  : 1; 
        uint8_t state_change : 1; 

        // State flags 
        uint8_t led_slow     : 1; 
        uint8_t led_fast     : 1; 
    } 
    thread_high_flags; 

    //==================================================

    //==================================================
    // Software Timer Thread 

    // Software timers 
    TimerHandle_t slow_blink_timer; 
    TimerHandle_t fast_blink_timer; 

    //==================================================

    //==================================================
    // General 

    // LED pin data 
    GPIO_TypeDef *led_gpio; 
    gpio_pin_num_t led_pin; 
    gpio_pin_state_t led_state; 

    // Serial terminal data 
    uint8_t uart_dma_buff[SERIAL_INPUT_MAX_LEN];   // Circular buffer 
    uint8_t buff_index;                            // Circular buffer index 
    uint8_t user_in_buff[SERIAL_INPUT_MAX_LEN];    // Stores latest user input 

    //==================================================

public:   // Public members 
    
    //==================================================
    // Low Priority Thread 
    //==================================================

    //==================================================
    // High Priority Thread 
    //==================================================

    //==================================================
    // Software Timer Thread 
    //==================================================

private:   // Private member functions 

    //==================================================
    // General 

    // State function pointer 
    typedef void (*state_func_ptr)(Event event); 

    //==================================================
    
    //==================================================
    // Low Priority Thread 

    // Event loop dispatch function 
    void DispatchThreadLow(Event event); 

    // State functions 
    static void ThreadLowState0(Event event); 
    static void ThreadLowState1(Event event); 

    // State table 
    const state_func_ptr thread_low_state_table[(uint8_t)ThreadLowStates::NUM_STATES] = 
    {
        &ThreadLowState0, 
        &ThreadLowState1 
    }; 

    //==================================================

    //==================================================
    // High Priority Thread 

    // Event loop dispatch function 
    void DispatchThreadHigh(Event event); 

    // State functions 
    static void ThreadHighState0(Event event); 
    static void ThreadHighState1(Event event); 

