samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
    // State table 
    const state_func_ptr thread_high_state_table[(uint8_t)ThreadHighStates::NUM_STATES] = 
    {
        &ThreadHighState0, 
        &ThreadHighState1 
    }; 

    //==================================================

    //==================================================
    // Software Timer Thread 

    // Called when LED toggle timers expire 
    void LEDTimerCallback(TimerHandle_t xTimer); 

    //==================================================

public:   // Public member functions 

    // Constructor(s) 
    SystemData() {} 

    // Destructor(s) 
    ~SystemData() {} 

    // Setup 
    void SystemDataInit(void); 
    
    //==================================================
    // Low Priority Thread
    //==================================================

    //==================================================
    // High Priority Thread
    //==================================================

    //==================================================
    // Software Timer Thread
    //==================================================
}; 

// System object 
static SystemData system_data; 

// Setup code 
void SystemData::SystemDataInit(void)
{
    // 
}


void SystemData::DispatchThreadHigh(Event event)
{
    // 
}

void SystemData::ThreadHighState0(Event event)
{
    // 
}

void SystemData::ThreadHighState1(Event event)
{
    // 
}


// Called when LED toggle timers expire 
void SystemData::LEDTimerCallback(TimerHandle_t xTimer)
{
    // 
}

//=======================================================================================


//=======================================================================================
// Low Priority Thread module data 

// Local data to the low priority thread 

//==================================================
// Enums 

// Low Priority Thread states 
typedef enum {
    THREAD_LOW_SERIAL_OUT_STATE, 
    THREAD_LOW_SERIAL_IN_STATE, 
    THREAD_LOW_NUM_STATES 
} ThreadLowStates; 

// Low Priority Thread event indexes 
typedef enum {
    THREAD_LOW_NO_EVENT, 
    THREAD_LOW_SERIAL_OUT_EVENT, 
    THREAD_LOW_SERIAL_IN_EVENT 
} ThreadLowEvents; 

//==================================================

//==================================================
// Objects 

// Low Priority Thread trackers 
struct ThreadLowTrackers 
{
    // System info 
    ThreadEventData event_data; 
    ThreadLowStates state; 

    // Serial terminal data 
    uint8_t uart_dma_buff[SERIAL_INPUT_MAX_LEN];   // Circular buffer 
    uint8_t buff_index;                            // Circular buffer index 
    uint8_t user_in_buff[SERIAL_INPUT_MAX_LEN];    // Stores latest user input 

    // State flags 
    uint8_t state_entry : 1; 
    uint8_t serial_out  : 1; 
    uint8_t serial_in   : 1; 
}; 

// Low Priority Thread object 
static ThreadLowTrackers thread_low_trackers; 

//==================================================

//==================================================
// Variables 

// Queue info 
static const uint8_t thread_low_queue_len = 3; 

//==================================================

//==================================================
// Function pointers 

// State function pointers 
typedef void (*thread_low_state_ptr)(ThreadLowTrackers *trackers, Event event); 

//==================================================

//==================================================
// Prototypes 

// Setup 
void ThreadLowSetup(void); 

// Dispatch functions 
void DispatchThreadLow(Event event); 

// State functions 
void ThreadLowState0(ThreadLowTrackers *trackers, Event event); 
void ThreadLowState1(ThreadLowTrackers *trackers, Event event); 

//==================================================

//==================================================
// Control data 

// Low Priority Thread state table 
static const thread_low_state_ptr thread_low_state_table[THREAD_LOW_NUM_STATES] = 
{
    &ThreadLowState0,   // State 0 
    &ThreadLowState1    // State 1 
}; 

//==================================================

//=======================================================================================


//=======================================================================================
// High Priority Thread module data 

// Local data to the high priority thread 

//==================================================
// Enums 

// High Priority thread states 
typedef enum {
    THREAD_HIGH_LED_SLOW_STATE, 
    THREAD_HIGH_LED_FAST_STATE, 
    THREAD_HIGH_NUM_STATES 
} ThreadHighStates; 

// High Priority Thread event indexes 
typedef enum {
    THREAD_HIGH_NO_EVENT, 
    THREAD_HIGH_LED_TOGGLE_EVENT 
} ThreadHighEvents; 

//==================================================

//==================================================
// Objects 

// High Priority Thread trackers 
struct ThreadHighTrackers 
{
    // System info 
    ThreadEventData event_data; 
    ThreadHighStates state; 

    // LED timers 
    TimerHandle_t slow_blink_timer; 
    TimerHandle_t fast_blink_timer; 

    // LED pin data 
    GPIO_TypeDef *led_gpio; 
    gpio_pin_num_t led_pin; 
    gpio_pin_state_t led_state; 

    // State flags 
    uint8_t state_entry  : 1; 
    uint8_t state_change : 1; 
    uint8_t led_slow     : 1; 
    uint8_t led_fast     : 1; 
}; 

// High Priority Thread object 
static ThreadHighTrackers thread_high_trackers; 

//==================================================

//==================================================
// Variables 

// Queue info 
static const uint8_t thread_high_queue_len = 3; 

//==================================================

//==================================================
// Function pointers 

// State function pointers 
typedef void (*thread_high_state_ptr)(ThreadHighTrackers *trackers, Event event); 

//==================================================

//==================================================
// Prototypes 

// Setup 
void ThreadHighSetup(void); 

// Dispatch functions 
void DispatchThreadHigh(Event event); 

// State functions 
void ThreadHighState0(ThreadHighTrackers *trackers, Event event); 
void ThreadHighState1(ThreadHighTrackers *trackers, Event event); 

// Helper functions 
void ThreadHighStateToggle(void); 
void ThreadHighStateTrigger(void); 

//==================================================

//==================================================
// Control data 

// High Priority Thread state table 
static const thread_high_state_ptr thread_high_state_table[THREAD_HIGH_NUM_STATES] = 
{
    &ThreadHighState0,   // State 0 
    &ThreadHighState1    // State 1 
}; 

//==================================================

//=======================================================================================


//=======================================================================================
// Software Timer Thread 

//==================================================
// Prototypes 

// Called when LED toggle timers expire 
void LEDTimerCallback(TimerHandle_t xTimer); 

//==================================================

//=======================================================================================


//=======================================================================================
// Event module(s) 

//==================================================
// Prototypes 

/**
 * @brief Event: Serial Output 
 * 
 * @param output_buff : data to output 
 */
void SerialOutEvent(char *output_buff); 

/**
 * @brief Event: Serial Input 
 * 
 * @param circular_buff 
 * @param circular_buff_index 
 * @param input_buff 
 */
void SerialInEvent(
    uint8_t *circular_buff, 
    uint8_t *circular_buff_index, 
    uint8_t *input_buff); 

/**
 * @brief Event: Pin Toggle (used to toggle the board LED) 
 * 
 * @param pin_gpio 
 * @param pin_num 
 * @param pin_state 
 */
void PinToggleEvent(
    GPIO_TypeDef *pin_gpio, 
    gpio_pin_num_t pin_num, 
    gpio_pin_state_t *pin_state); 

//==================================================

//=======================================================================================


//=======================================================================================
// Test functions 

// Active Object test setup code 
void active_object_test_init(void)
{
    // Initialize FreeRTOS scheduler 
    osKernelInitialize(); 

    //==================================================
    // Other general setup (pins, ports, etc.) 

    // Initialize GPIO ports 
    gpio_port_init(); 

    //==================================================

    // Priority group setup 
    ThreadLowSetup(); 
    ThreadHighSetup(); 
}


