samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
    // Run state function 
    thread_low_state_table[state](&thread_low_trackers, event); 
    thread_low_trackers.state = state; 
}


// In practice the state functions would likely be in the same file as the function that 
// dispatched them. Each dispatching function would likely have its own file. 

// Low Priority Thread: State 0 
void ThreadLowState0(
    ThreadLowTrackers *trackers, 
    Event event)
{
    // State entry 
    if (thread_low_trackers.state_entry)
    {
        thread_low_trackers.state_entry = CLEAR_BIT; 
    }

    // Event selection 
    switch (event)
    {
        case THREAD_LOW_SERIAL_OUT_EVENT: 
            SerialOutEvent((char *)thread_low_trackers.user_in_buff); 
            break; 

        default: 
            break; 
    }

    // State exit 
    if (thread_low_trackers.serial_in)
    {
        thread_low_trackers.state_entry = SET_BIT; 
        thread_low_trackers.serial_out = CLEAR_BIT; 
    }
}


// Low Priority Thread: State 1 
void ThreadLowState1(
    ThreadLowTrackers *trackers, 
    Event event)
{
    // State entry 
    if (thread_low_trackers.state_entry)
    {
        thread_low_trackers.state_entry = CLEAR_BIT; 
    }

    // Event selection 
    switch (event)
    {
        case THREAD_LOW_SERIAL_IN_EVENT: 
            SerialInEvent(
                thread_low_trackers.uart_dma_buff, 
                &thread_low_trackers.buff_index, 
                thread_low_trackers.user_in_buff); 

            // Toggle the high priority thread state 
            ThreadHighStateToggle(); 
            
            // Trigger the next state and event 
            thread_low_trackers.serial_out = SET_BIT; 
            thread_low_trackers.event_data.event = THREAD_LOW_SERIAL_OUT_EVENT; 
            xQueueSend(thread_low_trackers.event_data.ThreadEventQueue, 
                       (void *)&thread_low_trackers.event_data.event, 0); 
            break; 

        default: 
            break; 
    }

    // State exit 
    if (thread_low_trackers.serial_out)
    {
        thread_low_trackers.state_entry = SET_BIT; 
        thread_low_trackers.serial_in = CLEAR_BIT; 
    }
}


#if INTERRUPT_OVERRIDE 

// USART2 - overridden 
void USART2_IRQHandler(void)
{
    handler_flags.usart2_flag = SET_BIT; 

    BaseType_t task_woken = pdFALSE; 

    // Trigger a state change and queue a serial input event 
    thread_low_trackers.serial_out = CLEAR_BIT; 
    thread_low_trackers.serial_in = SET_BIT; 
    thread_low_trackers.state_entry = SET_BIT; 

    thread_low_trackers.event_data.event = THREAD_LOW_SERIAL_IN_EVENT; 
    xQueueSendFromISR(thread_low_trackers.event_data.ThreadEventQueue, 
                      (void *)&thread_low_trackers.event_data.event, &task_woken); 

    // The following is needed to exit the ISR 
    dummy_read(USART2->SR); 
    dummy_read(USART2->DR); 
}

#endif   // INTERRUPT_OVERRIDE 

//=======================================================================================


//=======================================================================================
// High Priority Thread event control 

// In practice these dispatch functions would likely be separated into different files 
// to help organize the code. 

// Setup 
void ThreadHighSetup(void)
{
    // Initialize general data 
    thread_high_trackers.state = THREAD_HIGH_LED_SLOW_STATE; 
    thread_high_trackers.led_gpio = GPIOA; 
    thread_high_trackers.led_pin = GPIOX_PIN_5; 
    thread_high_trackers.led_state = GPIO_LOW; 
    thread_high_trackers.state_entry = SET_BIT; 
    thread_high_trackers.state_change = CLEAR_BIT; 
    thread_high_trackers.led_slow = SET_BIT; 
    thread_high_trackers.led_fast = CLEAR_BIT; 

    // Initialize board LED (on when logic low) 
    gpio_pin_init(GPIOA, PIN_5, MODER_GPO, OTYPER_PP, OSPEEDR_HIGH, PUPDR_NO); 

    // Thread definition, queue handle creation and dispatch function assignment 
    thread_high_trackers.event_data = 
    {
        .attr = { .name = "ThreadHigh", 
                  .attr_bits = CLEAR, 
                  .cb_mem = NULL, 
                  .cb_size = CLEAR, 
                  .stack_mem = NULL, 
                  .stack_size = THREAD_HIGH_STACK_SIZE, 
                  .priority = (osPriority_t)osPriorityHigh, 
                  .tz_module = CLEAR, 
                  .reserved = CLEAR }, 
        .event = THREAD_HIGH_NO_EVENT, 
        .ThreadEventQueue = xQueueCreate(thread_high_queue_len, sizeof(uint32_t)), 
        .dispatch = DispatchThreadHigh 
    }; 
    // Check that the queues were created successfully 

    // Create the thread(s) 
    osThreadNew(
        eventLoop, 
        (void *)&thread_high_trackers.event_data, 
        &thread_high_trackers.event_data.attr); 
    // Check that the thread creation worked 

    // Create timers 
    thread_high_trackers.slow_blink_timer = xTimerCreate(
        "one_shot_timer",               // Name of timer 
        LED_SLOW_BLINK_PERIOD,          // Period of timer (ticks) 
        pdTRUE,                         // Auto-relead --> pdTRUE == Repeat Timer 
        (void *)0,                      // Timer ID 
        LEDTimerCallback);              // Callback function 
    thread_high_trackers.fast_blink_timer = xTimerCreate(
        "one_shot_timer",               // Name of timer 
        LED_FAST_BLINK_PERIOD,          // Period of timer (ticks) 
        pdTRUE,                         // Auto-relead --> pdTRUE == Repeat Timer 
        (void *)1,                      // Timer ID 
        LEDTimerCallback);              // Callback function 
    // Check that timers were created successfully 

    // Queue and empty event to start the LED blinks 
    xQueueSend(thread_high_trackers.event_data.ThreadEventQueue, 
        (void *)&thread_high_trackers.event_data.event, 0); 
}


// Dispatch function for high priority thread 
void DispatchThreadHigh(Event event)
{
    // A thread does not necessarily need a state machine. Instead, there could simply be 
    // a list of events available for when they're requested. For example, the high 
    // priority thread could be dedicated to reading data from devices irrespective of 
    // state and each read gets triggered by a timer. 

    ThreadHighStates state = thread_high_trackers.state; 

    // Continuous events. These are thread events that happen irrespective of state. 

